+ source /root/mugen-riscv/libs/locallibs/common_lib.sh
++ python3 --version
++ '[' 0 -eq 0 ']'
++ source /root/mugen-riscv/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment.'
+ message='Start to prepare the test environment.'
+ python3 /root/mugen-riscv/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment.'
Fri Feb  3 03:40:53 2023 - INFO  - Start to prepare the test environment.
+ DNF_INSTALL php-dbg
+ pkgs=php-dbg
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen-riscv/libs/locallibs/rpm_manage.py install --pkgs php-dbg --node 1 --tempfile ''
+ tmpfile2=/tmp/tmppw6g3kv7
+ '[' -z '' ']'
+ tmpfile=/tmp/tmppw6g3kv7
+ LOG_INFO 'Finish preparing the test environment.'
+ message='Finish preparing the test environment.'
+ python3 /root/mugen-riscv/libs/locallibs/mugen_log.py --level info --message 'Finish preparing the test environment.'
Fri Feb  3 03:41:24 2023 - INFO  - Finish preparing the test environment.
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start to run test.'
+ message='Start to run test.'
+ python3 /root/mugen-riscv/libs/locallibs/mugen_log.py --level info --message 'Start to run test.'
Fri Feb  3 03:41:24 2023 - INFO  - Start to run test.
+ expect
spawn phpdbg --help
q

[1mphpdbg[0m
is
a
lightweight,
powerful
and
easy
to
use
debugging
platform
for
PHP5.4+
It
supports
the
following
commands:

[1mInformation[0m


[1mlist[0m





list
PHP
source


[1minfo[0m





displays
information
on
the
debug
session


[1mprint[0m




show
opcodes


[1mframe[0m




select
a
stack
frame
and
print
a
stack
frame
summary


[1mgenerator[0m
show
active
generators
or
select
a
generator
frame


[1mback[0m





shows
the
current
backtrace


[1mhelp[0m





provide
help
on
a
topic

[1mStarting
and
Stopping
Execution[0m


[1mexec[0m





set
execution
context


[1mstdin[0m




set
executing
script
from
stdin


[1mrun[0m






attempt
execution


[1mstep[0m





continue
execution
until
other
line
is
reached


[1mcontinue[0m

continue
execution


[1muntil[0m




continue
execution
up
to
the
given
location


[1mnext[0m





continue
execution
up
to
the
given
location
and
halt
on
the
first
line
after
it


[1mfinish[0m



continue
up
to
end
of
the
current
execution
frame


[1mleave[0m




continue
up
to
end
of
the
current
execution
frame
and
halt
after
the
calling
instruction


[1mbreak[0m




set
a
breakpoint
at
the
specified
target


[1mwatch[0m




set
a
watchpoint
on
$variable


[1mclear[0m




clear
one
or
all
breakpoints


[1mclean[0m




clean
the
execution
environment

[1mMiscellaneous[0m


[1mset[0m






set
the
phpdbg
configuration


[1msource[0m



execute
a
phpdbginit
script


[1mregister[0m

register
a
phpdbginit
function
as
a
command
alias


[1msh[0m







shell
a
command


[1mev[0m







evaluate
some
code


[1mquit[0m





exit
phpdbg

Type
[1mhelp
<command>[0m
or
([1mhelp
alias[0m)
to
get
detailed
help
on
any
of
the
above
commands,
for
example
[1mhelp
list[0m
or
[1mh
l[0m.

Note
that
help
will
also
match
partial
commands
if
unique
(and
list
out
options
if
not
unique),
so
[1mhelp
exp[0m
will
give
help
on
the
[1mexport[0m
command,
but
[1mhelp
ex[0m
will
list
the
summary
for
[1mexec[0m
and
[1mexport[0m.

Type
[1mhelp
aliases[0m
to
show
a
full
alias
list,
including
any
registered
phpdginit
functions
Type
[1mhelp
syntax[0m
for
a
general
introduction
to
the
command
syntax.
Type
[1mhelp
options[0m
for
a
list
of
phpdbg
command
line
options.
Type
[1mhelp
phpdbginit[0m
to
show
how
to
customise
the
debugger
environment.
+ phpdbg --version
+ grep phpdbg
phpdbg 8.0.0 (built: Nov 24 2020 17:04:03)
+ CHECK_RESULT 0
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log=
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ expect
spawn phpdbg
[0;32m[Welcome to phpdbg, the interactive PHP debugger, v8.0.0][0m
To get help using phpdbg type "help" and press enter
[0;32m[Please report bugs to <http://bugs.php.net/report.php>][0m
prompt> list
[1;31m[The command "list" expected at least 1 arguments (*) and received 0][0m
prompt> info
Execution Context Information

Readline   unavailable
Exec       none
Compiled   no
Stepping   off
Quietness  on
Oplog      off
Executing  no
Classes    136
Functions  1042
Constants  1789
Included   0
prompt> print
[1;31m[Not Executing!][0m
prompt> frame
[0;32m[Currently in frame #0][0m
prompt> generator
[1;31m[Not executing!][0m
prompt> back
[1;31m[Not executing!][0m
prompt> help

[1mphpdbg[0m
is
a
lightweight,
powerful
and
easy
to
use
debugging
platform
for
PHP5.4+
It
supports
the
following
commands:

[1mInformation[0m


[1mlist[0m





list
PHP
source


[1minfo[0m





displays
information
on
the
debug
session


[1mprint[0m




show
opcodes


[1mframe[0m




select
a
stack
frame
and
print
a
stack
frame
summary


[1mgenerator[0m
show
active
generators
or
select
a
generator
frame


[1mback[0m





shows
the
current
backtrace


[1mhelp[0m





provide
help
on
a
topic

[1mStarting
and
Stopping
Execution[0m


[1mexec[0m





set
execution
context


[1mstdin[0m




set
executing
script
from
stdin


[1mrun[0m






attempt
execution


[1mstep[0m





continue
execution
until
other
line
is
reached


[1mcontinue[0m

continue
execution


[1muntil[0m




continue
execution
up
to
the
given
location


[1mnext[0m





continue
execution
up
to
theq

given
location
and
halt
on
the
first
line
after
it


[1mfinish[0m



continue
up
to
end
of
the
current
execution
frame


[1mleave[0m




continue
up
to
end
of
the
current
execution
frame
and
halt
after
the
calling
instruction


[1mbreak[0m




set
a
breakpoint
at
the
specified
target


[1mwatch[0m




set
a
watchpoint
on
$variable


[1mclear[0m




clear
one
or
all
breakpoints


[1mclean[0m




clean
the
execution
environment

[1mMiscellaneous[0m


[1mset[0m






set
the
phpdbg
configuration


[1msource[0m



execute
a
phpdbginit
script


[1mregister[0m

register
a
phpdbginit
function
as
a
command
alias


[1msh[0m







shell
a
command


[1mev[0m







evaluate
some
code


[1mquit[0m





exit
phpdbg

Type
[1mhelp
<command>[0m
or
([1mhelp
alias[0m)
to
get
detailed
help
on
any
of
the
above
commands,
for
example
[1mhelp
list[0m
or
[1mh
l[0m.

Note
that
help
will
also
match
partial
commands
if
unique
(and
list
out
options
if
not
unique),
so
[1mhelp
exp[0m
will
give
help
on
the
[1mexport[0m
command,
but
[1mhelp
ex[0m
will
list
the
summary
for
[1mexec[0m
and
[1mexport[0m.

Type
[1mhelp
aliases[0m
to
show
a
full
alias
list,
including
any
registered
phpdginit
functions
Type
[1mhelp
syntax[0m
for
a
general
introduction
to
the
command
syntax.
Type
[1mhelp
options[0m
for
a
list
of
phpdbg
command
line
options.
Type
[1mhelp
phpdbginit[0m
to
show
how
to
customise
the
debugger
environment.
prompt> exec
expect: spawn id exp3 not open
    while executing
"expect "prompt> " {send "run\r"}"
+ LOG_INFO 'End of the test.'
+ message='End of the test.'
+ python3 /root/mugen-riscv/libs/locallibs/mugen_log.py --level info --message 'End of the test.'
Fri Feb  3 03:41:26 2023 - INFO  - End of the test.
+ CASE_RESULT 0
+ case_re=0
+ test -z ''
+ test 0 -eq 0
+ LOG_INFO 'succeed to execute the case.'
+ message='succeed to execute the case.'
+ python3 /root/mugen-riscv/libs/locallibs/mugen_log.py --level info --message 'succeed to execute the case.'
Fri Feb  3 03:41:27 2023 - INFO  - succeed to execute the case.
+ exec_result=
+ exit 0
+ post_test
+ LOG_INFO 'Start to restore the test environment.'
+ message='Start to restore the test environment.'
+ python3 /root/mugen-riscv/libs/locallibs/mugen_log.py --level info --message 'Start to restore the test environment.'
Fri Feb  3 03:41:28 2023 - INFO  - Start to restore the test environment.
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z /tmp/tmppw6g3kv7 ]]
+ '[' 0 -ne 0 ']'
+ '[' 1 == 0 ']'
+ python3 /root/mugen-riscv/libs/locallibs/rpm_manage.py remove --node 1 --pkgs '' --tempfile /tmp/tmppw6g3kv7
+ '[' 0 -ne 0 ']'
+ LOG_INFO 'Finish restoring the test environment.'
+ message='Finish restoring the test environment.'
+ python3 /root/mugen-riscv/libs/locallibs/mugen_log.py --level info --message 'Finish restoring the test environment.'
Fri Feb  3 03:41:38 2023 - INFO  - Finish restoring the test environment.
